KaijianLi/STM32_Project/STM32_FLEXO_SmartCar/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2023 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f1xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define LED_Pin GPIO_PIN_13
#define LED_GPIO_Port GPIOC
#define OLED_CS_Pin GPIO_PIN_14
#define OLED_CS_GPIO_Port GPIOC
#define OLED_DC_Pin GPIO_PIN_15
#define OLED_DC_GPIO_Port GPIOC
#define W1_PWM_OUT_Pin GPIO_PIN_0
#define W1_PWM_OUT_GPIO_Port GPIOA
#define W2_PWM_OUT_Pin GPIO_PIN_1
#define W2_PWM_OUT_GPIO_Port GPIOA
#define SERVO1_Pin GPIO_PIN_6
#define SERVO1_GPIO_Port GPIOA
#define SERVO2_Pin GPIO_PIN_7
#define SERVO2_GPIO_Port GPIOA
#define OLED_D0_Pin GPIO_PIN_0
#define OLED_D0_GPIO_Port GPIOB
#define W1_GPIO_IN_Pin GPIO_PIN_12
#define W1_GPIO_IN_GPIO_Port GPIOB
#define W2_GPIO_IN_Pin GPIO_PIN_13
#define W2_GPIO_IN_GPIO_Port GPIOB
#define W1_PWM_IN_Pin GPIO_PIN_8
#define W1_PWM_IN_GPIO_Port GPIOA
#define W1_PWM_IN_EXTI_IRQn EXTI9_5_IRQn
#define W2_PWM_IN_Pin GPIO_PIN_9
#define W2_PWM_IN_GPIO_Port GPIOA
#define W2_PWM_IN_EXTI_IRQn EXTI9_5_IRQn
#define W2_GPIO_OUT_Pin GPIO_PIN_4
#define W2_GPIO_OUT_GPIO_Port GPIOB
#define W1_GPIO_OUT_Pin GPIO_PIN_5
#define W1_GPIO_OUT_GPIO_Port GPIOB
#define MPU_SCL_Pin GPIO_PIN_8
#define MPU_SCL_GPIO_Port GPIOB
#define MPU_SDA_Pin GPIO_PIN_9
#define MPU_SDA_GPIO_Port GPIOB
/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
